In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
lst = ['a','b','c']
num=[1,2,3]
arr = np.array(num)
d ={'A':10,'C':20,'D':30}

In [5]:
d

{'A': 10, 'C': 20, 'D': 30}

In [6]:
pd.Series(data = num)

0    1
1    2
2    3
dtype: int64

In [41]:
pd.Series(data = num, index = lst)

a    1
b    2
c    3
dtype: int64

In [42]:
pd.Series(num,lst)

a    1
b    2
c    3
dtype: int64

In [43]:
ser = pd.Series(lst)

In [44]:
ser[0]

'a'

In [45]:
ser

0    a
1    b
2    c
dtype: object

In [46]:
ser

0    a
1    b
2    c
dtype: object

In [47]:
from numpy.random import randn

In [49]:
np.random.seed(101)

In [56]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [57]:
df

          W         X         Y         Z
A  1.024810 -0.925874  1.862864 -1.133817
B  0.610478  0.386030  2.084019 -0.376519
C  0.230336  0.681209  1.035125 -0.031160
D  1.939932 -1.005187 -0.741790  0.187125
E -0.732845 -1.382920  1.482495  0.961458

In [58]:
df['new']= df['W']+df['X']

In [59]:
df['new']

A    0.098936
B    0.996508
C    0.911546
D    0.934745
E   -2.115765
Name: new, dtype: float64

In [60]:
df

          W         X         Y         Z       new
A  1.024810 -0.925874  1.862864 -1.133817  0.098936
B  0.610478  0.386030  2.084019 -0.376519  0.996508
C  0.230336  0.681209  1.035125 -0.031160  0.911546
D  1.939932 -1.005187 -0.741790  0.187125  0.934745
E -0.732845 -1.382920  1.482495  0.961458 -2.115765

In [61]:
df[df['W'] > 0]

          W         X         Y         Z       new
A  1.024810 -0.925874  1.862864 -1.133817  0.098936
B  0.610478  0.386030  2.084019 -0.376519  0.996508
C  0.230336  0.681209  1.035125 -0.031160  0.911546
D  1.939932 -1.005187 -0.741790  0.187125  0.934745

In [63]:
df[df['W'] > 0][['X','Y']]

          X         Y
A -0.925874  1.862864
B  0.386030  2.084019
C  0.681209  1.035125
D -1.005187 -0.741790

In [64]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [65]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [66]:
df =pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [67]:
df

             A         B
G1 1 -2.141212  0.992573
   2  1.192241 -1.046780
   3  1.292765 -1.467514
G2 1 -0.494095 -0.162535
   2  0.485809  0.392489
   3  0.221491 -0.855196

In [72]:
df.loc['G1']

          A         B
1 -2.141212  0.992573
2  1.192241 -1.046780
3  1.292765 -1.467514

In [75]:
df.loc['G1'].loc[1]

A   -2.141212
B    0.992573
Name: 1, dtype: float64

In [76]:
df.index.names=['Group','Num']

In [77]:
df

                  A         B
Group Num
G1    1   -2.141212  0.992573
      2    1.192241 -1.046780
      3    1.292765 -1.467514
G2    1   -0.494095 -0.162535
      2    0.485809  0.392489
      3    0.221491 -0.855196

In [78]:
df.loc['G2']

            A         B
Num
1   -0.494095 -0.162535
2    0.485809  0.392489
3    0.221491 -0.855196

In [80]:
df.loc['G2'].loc[2]['B']

0.39248881107944394

In [88]:
df.loc['G1'].loc[3]['A']

1.2927645769293514

In [89]:
df

                  A         B
Group Num
G1    1   -2.141212  0.992573
      2    1.192241 -1.046780
      3    1.292765 -1.467514
G2    1   -0.494095 -0.162535
      2    0.485809  0.392489
      3    0.221491 -0.855196

In [90]:
df.xs(1,level='Num')

              A         B
Group
G1    -2.141212  0.992573
G2    -0.494095 -0.162535

In [91]:
d= {'A':[1,2,np.nan],'B':[np.nan,np.nan,3],'C':[1,2,3]}

In [92]:
df = pd.DataFrame(d)

In [93]:
df

     A    B  C
0  1.0  NaN  1
1  2.0  NaN  2
2  NaN  3.0  3

In [96]:
df.dropna(axis =1)

   C
0  1
1  2
2  3

In [97]:
df

     A    B  C
0  1.0  NaN  1
1  2.0  NaN  2
2  NaN  3.0  3

In [101]:
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [102]:
df.fillna('FILL')

      A     B  C
0   1.0  FILL  1
1   2.0  FILL  2
2  FILL   3.0  3

In [104]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [105]:
pwd

'/Users/harishk/Documents/Projects/ML'